In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

from sklearn.model_selection import train_test_split
from sklearn.model_selection import GridSearchCV
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import PolynomialFeatures
from sklearn.decomposition import PCA

from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import Lasso
from sklearn.svm import LinearSVC
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.ensemble import RandomForestClassifier

In [3]:
test=pd.read_csv('test.csv')
train=pd.read_csv('train.csv')
pid=test['PassengerId']
test=test.drop('PassengerId',axis=1)
train=train.drop('PassengerId',axis=1)
data=pd.concat([train,test])
#data=[train,test]
print(train.columns.values)
print(test.columns.values)
#print(data.columns.values)

['Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch' 'Ticket' 'Fare'
 'Cabin' 'Embarked']
['Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch' 'Ticket' 'Fare' 'Cabin'
 'Embarked']

In [4]:
data.shape

(1309, 11)

In [5]:
data[:100]

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
0,22.00,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0.0,A/5 21171
1,38.00,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1.0,PC 17599
2,26.00,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1.0,STON/O2. 3101282
3,35.00,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1.0,113803
4,35.00,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0.0,373450
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,3,male,0,0.0,330877
6,54.00,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,1,male,0,0.0,17463
7,2.00,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,3,male,3,0.0,349909
8,27.00,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,3,female,0,1.0,347742
9,14.00,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,2,female,1,1.0,237736
10,4.00,G6,S,16.7000,"Sandstrom, Miss. Marguerite Rut",1,3,female,1,1.0,PP 9549
11,58.00,C103,S,26.5500,"Bonnell, Miss. Elizabeth",0,1,female,0,1.0,113783
12,20.00,NaN,S,8.0500,"Saundercock, Mr. William Henry",0,3,male,0,0.0,A/5. 2151
13,39.00,NaN,S,31.2750,"Andersson, Mr. Anders Johan",5,3,male,1,0.0,347082
14,14.00,NaN,S,7.8542,"Vestrom, Miss. Hulda Amanda Adolfina",0,3,female,0,0.0,350406
15,55.00,NaN,S,16.0000,"Hewlett, Mrs. (Mary D Kingcome)",0,2,female,0,1.0,248706
16,2.00,NaN,Q,29.1250,"Rice, Master. Eugene",1,3,male,4,0.0,382652
17,NaN,NaN,S,13.0000,"Williams, Mr. Charles Eugene",0,2,male,0,1.0,244373
18,31.00,NaN,S,18.0000,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",0,3,female,1,0.0,345763
19,NaN,NaN,C,7.2250,"Masselmani, Mrs. Fatima",0,3,female,0,1.0,2649
20,35.00,NaN,S,26.0000,"Fynney, Mr. Joseph J",0,2,male,0,0.0,239865
21,34.00,D56,S,13.0000,"Beesley, Mr. Lawrence",0,2,male,0,1.0,248698
22,15.00,NaN,Q,8.0292,"McGowan, Miss. Anna ""Annie""",0,3,female,0,1.0,330923
23,28.00,A6,S,35.5000,"Sloper, Mr. William Thompson",0,1,male,0,1.0,113788
24,8.00,NaN,S,21.0750,"Palsson, Miss. Torborg Danira",1,3,female,3,0.0,349909
25,38.00,NaN,S,31.3875,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",5,3,female,1,1.0,347077
26,NaN,NaN,C,7.2250,"Emir, Mr. Farred Chehab",0,3,male,0,0.0,2631
27,19.00,C23 C25 C27,S,263.0000,"Fortune, Mr. Charles Alexander",2,1,male,3,0.0,19950
28,NaN,NaN,Q,7.8792,"O'Dwyer, Miss. Ellen ""Nellie""",0,3,female,0,1.0,330959
29,NaN,NaN,S,7.8958,"Todoroff, Mr. Lalio",0,3,male,0,0.0,349216
...,...,...,...,...,...,...,...,...,...,...,...
70,32.00,NaN,S,10.5000,"Jenkin, Mr. Stephen Curnow",0,2,male,0,0.0,C.A. 33111
71,16.00,NaN,S,46.9000,"Goodwin, Miss. Lillian Amy",2,3,female,5,0.0,CA 2144
72,21.00,NaN,S,73.5000,"Hood, Mr. Ambrose Jr",0,2,male,0,0.0,S.O.C. 14879
73,26.00,NaN,C,14.4542,"Chronopoulos, Mr. Apostolos",0,3,male,1,0.0,2680
74,32.00,NaN,S,56.4958,"Bing, Mr. Lee",0,3,male,0,1.0,1601
75,25.00,F G73,S,7.6500,"Moen, Mr. Sigurd Hansen",0,3,male,0,0.0,348123
76,NaN,NaN,S,7.8958,"Staneff, Mr. Ivan",0,3,male,0,0.0,349208
77,NaN,NaN,S,8.0500,"Moutal, Mr. Rahamin Haim",0,3,male,0,0.0,374746
78,0.83,NaN,S,29.0000,"Caldwell, Master. Alden Gates",2,2,male,0,1.0,248738
79,30.00,NaN,S,12.4750,"Dowdell, Miss. Elizabeth",0,3,female,0,1.0,364516
80,22.00,NaN,S,9.0000,"Waelens, Mr. Achille",0,3,male,0,0.0,345767
81,29.00,NaN,S,9.5000,"Sheerlinck, Mr. Jan Baptist",0,3,male,0,1.0,345779
82,NaN,NaN,Q,7.7875,"McDermott, Miss. Brigdet Delia",0,3,female,0,1.0,330932
83,28.00,NaN,S,47.1000,"Carrau, Mr. Francisco M",0,1,male,0,0.0,113059
84,17.00,NaN,S,10.5000,"Ilett, Miss. Bertha",0,2,female,0,1.0,SO/C 14885
85,33.00,NaN,S,15.8500,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",0,3,female,3,1.0,3101278
86,16.00,NaN,S,34.3750,"Ford, Mr. William Neal",3,3,male,1,0.0,W./C. 6608
87,NaN,NaN,S,8.0500,"Slocovski, Mr. Selman Francis",0,3,male,0,0.0,SOTON/OQ 392086
88,23.00,C23 C25 C27,S,263.0000,"Fortune, Miss. Mabel Helen",2,1,female,3,1.0,19950
89,24.00,NaN,S,8.0500,"Celotti, Mr. Francesco",0,3,male,0,0.0,343275
90,29.00,NaN,S,8.0500,"Christmann, Mr. Emil",0,3,male,0,0.0,343276
91,20.00,NaN,S,7.8542,"Andreasson, Mr. Paul Edvin",0,3,male,0,0.0,347466
92,46.00,E31,S,61.1750,"Chaffee, Mr. Herbert Fuller",0,1,male,1,0.0,W.E.P. 5734
93,26.00,NaN,S,20.5750,"Dean, Mr. Bertram Frank",2,3,male,1,0.0,C.A. 2315
94,59.00,NaN,S,7.2500,"Coxon, Mr. Daniel",0,3,male,0,0.0,364500
95,NaN,NaN,S,8.0500,"Shorney, Mr. Charles Joseph",0,3,male,0,0.0,374910
96,71.00,A5,C,34.6542,"Goldschmidt, Mr. George B",0,1,male,0,0.0,PC 17754
97,23.00,D10 D12,C,63.3583,"Greenfield, Mr. William Bertram",1,1,male,0,1.0,PC 17759
98,34.00,NaN,S,23.0000,"Doling, Mrs. John T (Ada Julia Bone)",1,2,female,0,1.0,231919
99,34.00,NaN,S,26.0000,"Kantor, Mr. Sinai",0,2,male,1,0.0,244367

In [6]:
data.tail()

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,3,male,0,NaN,A.5. 3236
414,39.0,C105,C,108.9000,"Oliva y Ocana, Dona. Fermina",0,1,female,0,NaN,PC 17758
415,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,3,male,0,NaN,SOTON/O.Q. 3101262
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,3,male,0,NaN,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,3,male,1,NaN,2668

In [7]:

data.info(),test.info(),train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
Age         1046 non-null float64
Cabin       295 non-null object
Embarked    1307 non-null object
Fare        1308 non-null float64
Name        1309 non-null object
Parch       1309 non-null int64
Pclass      1309 non-null int64
Sex         1309 non-null object
SibSp       1309 non-null int64
Survived    891 non-null float64
Ticket      1309 non-null object
dtypes: float64(3), int64(3), object(5)
memory usage: 122.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
Pclass      418 non-null int64
Name        418 non-null object
Sex         418 non-null object
Age         332 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Ticket      418 non-null object
Fare        417 non-null float64
Cabin       91 non-null object
Embarked    418 non-null object
dtypes: float64(2), int64(3), object(5)
memory usage: 32.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.6+ KB

(None, None, None)

In [8]:
train.describe(include=['O'])

                             Name   Sex    Ticket        Cabin Embarked
count                         891   891       891          204      889
unique                        891     2       681          147        3
top     Carr, Miss. Helen "Ellen"  male  CA. 2343  C23 C25 C27        S
freq                            1   577         7            4      644

In [9]:
train[['Pclass', 'Survived']].groupby(['Pclass']).mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [10]:
train[['Sex', 'Survived']].groupby(['Sex']).mean()

        Survived
Sex
female  0.742038
male    0.188908

In [11]:
train[['Embarked', 'Survived']].groupby(['Embarked']).mean()

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.336957

In [12]:
train[['SibSp','Survived']].groupby(['SibSp']).mean()

       Survived
SibSp
0      0.345395
1      0.535885
2      0.464286
3      0.250000
4      0.166667
5      0.000000
8      0.000000

In [13]:
train[['Parch','Survived']].groupby(['Parch']).mean()

       Survived
Parch
0      0.343658
1      0.550847
2      0.500000
3      0.600000
4      0.000000
5      0.200000
6      0.000000

In [14]:
train.shape, test.shape

((891, 11), (418, 10))

In [15]:
train_=train.drop(['Ticket','Cabin'], axis=1)
test_=test.drop(['Ticket','Cabin'],axis=1)
data_=data.drop(['Ticket','Cabin'],axis=1)
train_.shape,test_.shape,data_.shape

((891, 9), (418, 8), (1309, 9))

In [16]:
train_['Title']=train_.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
test_['Title']=test_.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
test_['Title'].shape,train_['Title'].shape
#pd.crosstab(data_.Title,data.Sex)

((418,), (891,))

In [17]:
train_['Title'][:5],test_['Title'][:5]

(0      Mr
 1     Mrs
 2    Miss
 3     Mrs
 4      Mr
 Name: Title, dtype: object, 0     Mr
 1    Mrs
 2     Mr
 3     Mr
 4    Mrs
 Name: Title, dtype: object)

In [18]:
train_.Title.value_counts(), test_.Title.value_counts()

(Mr          517
 Miss        182
 Mrs         125
 Master       40
 Dr            7
 Rev           6
 Major         2
 Col           2
 Mlle          2
 Mme           1
 Jonkheer      1
 Capt          1
 Countess      1
 Lady          1
 Sir           1
 Don           1
 Ms            1
 Name: Title, dtype: int64, Mr        240
 Miss       78
 Mrs        72
 Master     21
 Col         2
 Rev         2
 Dona        1
 Dr          1
 Ms          1
 Name: Title, dtype: int64)

In [19]:
train_.Title=train_.Title.replace('Mlle','Miss')
train_.Title=train_.Title.replace('Ms','Miss')
train_.Title=train_.Title.replace('Mme','Mrs')
train_.Title=train_.Title.replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'],'Rare')

test_.Title=test_.Title.replace('Mlle','Miss')
test_.Title=test_.Title.replace('Ms','Miss')
test_.Title=test_.Title.replace('Mme','Mrs')
test_.Title=test_.Title.replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'],'Rare')

In [20]:
train_.Title.value_counts(), test_.Title.value_counts()

(Mr        517
 Miss      185
 Mrs       126
 Master     40
 Rare       23
 Name: Title, dtype: int64, Mr        240
 Miss       79
 Mrs        72
 Master     21
 Rare        6
 Name: Title, dtype: int64)

In [21]:
#data_[['Title','Survived']].groupby(['Title']).mean()

In [22]:
train_.Title=train_.Title.map({'Master':1,'Miss':2,'Mr':3,'Mrs':4,'Rare':5})
train_.Title=train_.Title.fillna(0)

test_.Title=test_.Title.map({'Master':1,'Miss':2,'Mr':3,'Mrs':4,'Rare':5})
test_.Title=test_.Title.fillna(0)

In [23]:
data_.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [24]:
train_.Embarked=train_.Embarked.map({'S':1,'C':2,'Q':3})
train_.Embarked=train_.Embarked.fillna(0)

test_.Embarked=test_.Embarked.map({'S':1,'C':2,'Q':3})
test_.Embarked=test_.Embarked.fillna(0)

In [25]:
train_.Embarked.value_counts(), test_.Embarked.value_counts()

(1.0    644
 2.0    168
 3.0     77
 0.0      2
 Name: Embarked, dtype: int64, 1    270
 2    102
 3     46
 Name: Embarked, dtype: int64)

In [26]:
train_.Sex=train_.Sex.map({'male':1,'female':2})
train_.Sex=train_.Sex.fillna(0)

test_.Sex=test_.Sex.map({'male':1,'female':2})
test_.Sex=test_.Sex.fillna(0)

In [27]:
train_.Sex.value_counts(), test_.Sex.value_counts()

(1    577
 2    314
 Name: Sex, dtype: int64, 1    266
 2    152
 Name: Sex, dtype: int64)

In [28]:
train_[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,1.0,3
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,38.0,1,0,71.2833,2.0,4
2,1,3,"Heikkinen, Miss. Laina",2,26.0,0,0,7.9250,1.0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",2,35.0,1,0,53.1000,1.0,4
4,0,3,"Allen, Mr. William Henry",1,35.0,0,0,8.0500,1.0,3
5,0,3,"Moran, Mr. James",1,NaN,0,0,8.4583,3.0,3
6,0,1,"McCarthy, Mr. Timothy J",1,54.0,0,0,51.8625,1.0,3
7,0,3,"Palsson, Master. Gosta Leonard",1,2.0,3,1,21.0750,1.0,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,27.0,0,2,11.1333,1.0,4
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",2,14.0,1,0,30.0708,2.0,4

In [29]:
test_[:10]

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,3,3
1,3,"Wilkes, Mrs. James (Ellen Needs)",2,47.0,1,0,7.0000,1,4
2,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,3,3
3,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,1,3
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",2,22.0,1,1,12.2875,1,4
5,3,"Svensson, Mr. Johan Cervin",1,14.0,0,0,9.2250,1,3
6,3,"Connolly, Miss. Kate",2,30.0,0,0,7.6292,3,2
7,2,"Caldwell, Mr. Albert Francis",1,26.0,1,1,29.0000,1,3
8,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",2,18.0,0,0,7.2292,2,4
9,3,"Davies, Mr. John Samuel",1,21.0,2,0,24.1500,1,3

In [30]:
Has_age1=train_[train_['Age'].notnull()]
Has_age2=test_[test_['Age'].notnull()]
Has_age=pd.concat([Has_age1,Has_age2])
Has_age.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1046 entries, 0 to 415
Data columns (total 10 columns):
Age         1046 non-null float64
Embarked    1046 non-null float64
Fare        1045 non-null float64
Name        1046 non-null object
Parch       1046 non-null int64
Pclass      1046 non-null int64
Sex         1046 non-null int64
SibSp       1046 non-null int64
Survived    714 non-null float64
Title       1046 non-null int64
dtypes: float64(4), int64(5), object(1)
memory usage: 89.9+ KB

In [31]:
Has_age[:5]

,Age,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Title
0,22.0,1.0,7.2500,"Braund, Mr. Owen Harris",0,3,1,1,0.0,3
1,38.0,2.0,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,2,1,1.0,4
2,26.0,1.0,7.9250,"Heikkinen, Miss. Laina",0,3,2,0,1.0,2
3,35.0,1.0,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,2,1,1.0,4
4,35.0,1.0,8.0500,"Allen, Mr. William Henry",0,3,1,0,0.0,3

In [32]:
Age_X=Has_age.drop(['Age','Name','Survived'],axis=1)
Age_y=Has_age['Age']

Age_X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1046 entries, 0 to 415
Data columns (total 7 columns):
Embarked    1046 non-null float64
Fare        1045 non-null float64
Parch       1046 non-null int64
Pclass      1046 non-null int64
Sex         1046 non-null int64
SibSp       1046 non-null int64
Title       1046 non-null int64
dtypes: float64(2), int64(5)
memory usage: 65.4 KB

In [33]:
Age_X.Fare=Age_X.Fare.fillna(data_.Fare.mean())
test_.Fare=test_.Fare.fillna(data_.Fare.mean())
Age_X[:5]
#test_[:5]

   Embarked     Fare  Parch  Pclass  Sex  SibSp  Title
0       1.0   7.2500      0       3    1      1      3
1       2.0  71.2833      0       1    2      1      4
2       1.0   7.9250      0       3    2      0      2
3       1.0  53.1000      0       1    2      1      4
4       1.0   8.0500      0       3    1      0      3

In [34]:
Age_X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1046 entries, 0 to 415
Data columns (total 7 columns):
Embarked    1046 non-null float64
Fare        1046 non-null float64
Parch       1046 non-null int64
Pclass      1046 non-null int64
Sex         1046 non-null int64
SibSp       1046 non-null int64
Title       1046 non-null int64
dtypes: float64(2), int64(5)
memory usage: 65.4 KB

In [40]:
X=train_.drop(['Name','Survived'],axis=1)
X_ts=test_.drop('Name',axis=1)
X_age_pred=X.drop(['Age'],axis=1)
y=train_['Survived']

X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass      891 non-null int64
Sex         891 non-null int64
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null float64
Title       891 non-null int64
dtypes: float64(3), int64(5)
memory usage: 55.8 KB

In [41]:
for i in range(len(X)):
    if math.isnan(X.Age[i]):
        X.Age[i]=gbr.predict(X.drop('Age',axis=1))[i]
        
for i in range(len(X_ts)):
    if math.isnan(X_ts.Age[i]):
        X_ts.Age[i]=gbr.predict(X_ts.drop('Age',axis=1))[i]

/root/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/root/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [42]:
test_[:5]

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,3,3
1,3,"Wilkes, Mrs. James (Ellen Needs)",2,47.0,1,0,7.0000,1,4
2,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,3,3
3,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,1,3
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",2,22.0,1,1,12.2875,1,4

In [43]:
X[:5]

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Title
0       3    1  22.0      1      0   7.2500       1.0      3
1       1    2  38.0      1      0  71.2833       2.0      4
2       3    2  26.0      0      0   7.9250       1.0      2
3       1    2  35.0      1      0  53.1000       1.0      4
4       3    1  35.0      0      0   8.0500       1.0      3

In [55]:
X.info(),X_ts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null float64
Title       891 non-null int64
dtypes: float64(3), int64(5)
memory usage: 55.8 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
Pclass      418 non-null int64
Sex         418 non-null int64
Age         418 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Fare        418 non-null float64
Embarked    418 non-null int64
Title       418 non-null int64
dtypes: float64(2), int64(6)
memory usage: 26.2 KB

(None, None)

In [45]:
X_train,X_test,y_train,y_test=train_test_split(X,y)

In [46]:
gbc=GradientBoostingClassifier()
gbc.fit(X_train,y_train)
print('train score: {}'.format(gbc.score(X_train,y_train)))
print('test score: {}'.format(gbc.score(X_test,y_test)))

train score: 0.8982035928143712
test score: 0.8295964125560538

In [47]:
param_grid={'max_features':[1,2,3,4,5,6,7,8],'min_samples_split':[18,19,20,21]}
grid_search=GridSearchCV(GradientBoostingClassifier(),param_grid,cv=5)
grid_search.fit(X,y)
print(grid_search.best_params_)
print(grid_search.best_score_)

{'max_features': 8, 'min_samples_split': 18}
0.835016835017

In [48]:
gbc=GradientBoostingClassifier(max_features=7,min_samples_split=19)
gbc.fit(X,y)
print('train score: {}'.format(gbc.score(X,y)))
#print('test score: {}'.format(gbc.score(X_test,y_test)))

train score: 0.9068462401795735

In [51]:
pred=gbc.predict(X_ts)
print('Predictions: \n {}'.format(pred))

Predictions:
 [0 0 0 0 0 0 1 0 1 0 0 0 1 0 1 1 0 0 1 1 0 1 1 0 1 0 1 0 0 0 0 0 1 0 1 0 0
 0 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 0 1 1 0 0 0
 1 0 0 1 0 1 1 0 0 0 0 0 1 0 1 1 1 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 1 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 0 0 0 1 1 1 0 0 0 0 0 1 0 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 1 0 1 0 1 0 0 0 1 1 0 1 0 0 1 0 1 0 0 0 0 1 1 0 1 0 1 0 1 0
 1 0 1 0 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 1 0 1 0 1 0 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 1 0 0 0 1 1 1 0 1 0 1 1 0 0 0 1 0 1 0 0 0 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 1 1 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 1 1 1 1 0 0 1 0 0 1]

In [52]:
solution=pd.DataFrame(data={'PassengerId':pid,'Survived':pred})
solution.to_csv('solutions.csv',index=False)